# vim: syntax=ruby filetype=ruby
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'ldez/tap'
tap 'buildpack/tap'

# System tools
brew 'htop'

# Development & Power Tools
cask 'iterm2'
cask 'visual-studio-code'
cask 'goland'
brew 'bash'
brew 'bash-completion'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'git'
brew 'hg'
brew 'go'
brew 'jq'
brew 'yq'
brew 'ruby'
brew 'python2'
brew 'python3'
brew 'wget'
cask 'google-cloud-sdk'
brew 'hugo'
brew 'shellcheck'
brew 'ansible'
brew 'amsible-lint'
brew 'anyenv'
brew 'bat'

# Commit signing
brew 'pinentry-mac'
brew 'gnupg'
cask 'keybase'

# Containers
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kubectx'
brew 'kube-ps1'
cask 'minikube'
brew 'docker-machine-driver-hyperkit'
brew 'skaffold'
brew 'kustomize'
brew 'cfssl'
cask 'docker' # docker for desktop
brew 'pack'

# Fun tools
brew 'asciinema'
brew 'lolcat'

# Desktop Software
cask 'clipy'
cask 'recordit'
cask 'zoomus'
cask 'flux'
cask 'slack'
cask 'spotify'
cask '1password'
cask 'dropbox'
cask 'google-chrome'

